In [3]:

import numpy as np 
import pandas as pd 
# Reading data With help of pandas 
Train_data=pd.read_csv('titanic/train.csv')
Test_data=pd.read_csv('titanic/test.csv')

In [4]:
# Lets See What our dataset consist of , .head() will give you top 5 rows of the dataset
Train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
# Lets see How many rows and columns we have
Train_data.shape
# the training dataset consist of 891 rows and 12 columns

(891, 12)

In [6]:
# lets check how many Null values we have and datatype of our columns
Train_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [7]:
# Lets Drop some of the columns which aren't going to contribute much for our models
columns_to_drop = ["PassengerId","Name","Ticket","Cabin","Embarked"]
# these are the columns i am going to drop and make a new clean dataframe in which doesn't consist of these columns

In [8]:
#after dropping columns , make new_train_data is our new dataframe
New_train_data = Train_data.drop(columns_to_drop,axis=1)

In [9]:
# after dropping columns we are left with these columns
New_train_data.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0         0       3    male  22.0      1      0   7.2500
1         1       1  female  38.0      1      0  71.2833
2         1       3  female  26.0      0      0   7.9250
3         1       1  female  35.0      1      0  53.1000
4         0       3    male  35.0      0      0   8.0500

In [10]:
# As you can see the column Sex is categorical or object , so we have to map this as male 0 and female 1 
# Because we need everything numerical and we are using LabelEncoder to map this
from sklearn.preprocessing import LabelEncoder
enc = LabelEncoder()
New_train_data["Sex"] = enc.fit_transform(New_train_data["Sex"])

In [11]:
# Lets have a look again at dataset
New_train_data.head()
# You can see that we successfully convert the Survived columns to male 0 and female 1

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    1  22.0      1      0   7.2500
1         1       1    0  38.0      1      0  71.2833
2         1       3    0  26.0      0      0   7.9250
3         1       1    0  35.0      1      0  53.1000
4         0       3    1  35.0      0      0   8.0500

In [12]:
# Now lets deal with missing values in our age column and replace it with mean value
New_train_data = New_train_data.fillna(New_train_data["Age"].mean())
# Now take a look again
New_train_data.info()
# We dont have any missing values now

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Survived    891 non-null int64
Pclass      891 non-null int64
Sex         891 non-null int32
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
dtypes: float64(2), int32(1), int64(4)
memory usage: 45.4 KB

In [13]:
# Lets create X and Y , X is our features and y is our Output 
input_cols = ['Pclass',"Sex","Age","SibSp","Parch","Fare"]
output_cols = ["Survived"]

X = New_train_data[input_cols]
Y = New_train_data[output_cols]

print(X.shape,Y.shape)

(891, 6) (891, 1)

In [14]:
# We are going to convert our dataset in the range 0 to 1 it will help our model to converge faster
from sklearn.preprocessing import StandardScaler
scal=StandardScaler()
scal.fit(X)
std_scal=scal.transform(X)

In [15]:
# Lets divide our dataset 20% for testing and 80% for training
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split( std_scal, Y, test_size=0.2, random_state=42)

In [16]:
# now lets train our model , we are using two or three models eg KNN, SVM , Decission tree
from sklearn.neighbors import KNeighborsClassifier
knn=KNeighborsClassifier(n_neighbors=3)
knn.fit(X_train,y_train)

C:\Users\hp\Anaconda3\envs\tf_gpu\lib\site-packages\ipykernel_launcher.py:4: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  after removing the cwd from sys.path.

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=3, p=2,
                     weights='uniform')

In [17]:
# Lets predict and test our models accuracy
y_pred=knn.predict(X_test)

In [18]:
from sklearn.metrics import accuracy_score
print(accuracy_score(y_pred,y_test))

0.8044692737430168

In [19]:
from sklearn.svm import SVC
svmm=SVC(kernel="rbf")
svmm.fit(X_train,y_train)
y_pred=svmm.predict(X_test)
print(accuracy_score(y_pred,y_test))

0.8100558659217877

C:\Users\hp\Anaconda3\envs\tf_gpu\lib\site-packages\sklearn\utils\validation.py:724: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
C:\Users\hp\Anaconda3\envs\tf_gpu\lib\site-packages\sklearn\svm\base.py:193: FutureWarning: The default value of gamma will change from 'auto' to 'scale' in version 0.22 to account better for unscaled features. Set gamma explicitly to 'auto' or 'scale' to avoid this warning.
  "avoid this warning.", FutureWarning)

In [20]:
# Now lets create csv for submission from test.csv by appling same method as we done on train.csv
Test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [21]:
passengerid=Test_data["PassengerId"]
Test_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [22]:
columns_to_drop = ["PassengerId","Name","Ticket","Cabin","Embarked"]
Test_data_clean = Test_data.drop(columns_to_drop,axis=1)

In [23]:
from sklearn.preprocessing import LabelEncoder

le = LabelEncoder()

Test_data_clean["Sex"] = le.fit_transform(Test_data_clean["Sex"])

In [24]:
Test_data_clean.head()

   Pclass  Sex   Age  SibSp  Parch     Fare
0       3    1  34.5      0      0   7.8292
1       3    0  47.0      1      0   7.0000
2       2    1  62.0      0      0   9.6875
3       3    1  27.0      0      0   8.6625
4       3    0  22.0      1      1  12.2875

In [25]:
Test_data_clean = Test_data_clean.fillna(Test_data_clean["Age"].mean())

In [26]:
Test_data_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 6 columns):
Pclass    418 non-null int64
Sex       418 non-null int32
Age       418 non-null float64
SibSp     418 non-null int64
Parch     418 non-null int64
Fare      418 non-null float64
dtypes: float64(2), int32(1), int64(3)
memory usage: 18.1 KB

In [27]:
from sklearn.preprocessing import StandardScaler
scal=StandardScaler()
scal.fit(Test_data_clean)
X_test2=scal.transform(Test_data_clean)

In [28]:
y_pred=svmm.predict(X_test2)

In [29]:
# we have to submit csv with columns passengerid and survived after prediction from our model
submission = pd.DataFrame({
        "PassengerId": passengerid,
        "Survived": y_pred
    })

In [30]:
submission.to_csv('submission1.csv', index=False)